# Напишите пример любого класса и создайте его объект

class Terminator:
    def print(self):
        print('bazuka')

t800 = Terminator
print(t800)

t800_101 = Terminator()
t800_101.print()